#Задачка про аббревиатуры
#Владимир устроился на работу в одно очень важное место.
#И в первом же документе он ничего не понял, там были сплошные ФГУП НИЦ ГИДГЕО, ФГОУ ЧШУ АПК и т.п.
#Тогда он решил собрать все аббревиатуры, чтобы потом найти их расшифровки на http://sokr.ru/. Помогите ему. Будем считать аббревиатурой слова
#только лишь из заглавных букв (как минимум из двух). Если несколько таких слов разделены пробелами, то они считаются одной аббревиатурой.
#Ввод: Это курс информатики соответствует ФГОС и ПООП, это подтверждено ФГУ ФНЦ НИИСИ РАН\
      #Вывод: ФГОС, ПООП, ФГУ ФНЦ НИИСИ РАН
#Регулярка должна работать для любой строки (а не толкьо для конкретного написанного тут примера!)

import re
s = 'Это курс информатики соответствует ФГОС и ПООП, это подтверждено ФГУ ФНЦ НИИСИ РАН'
pattern = r'\b\w+([А-Я ]+[А-Я ]+[А-Я ]+[А-Я ]+)'
re.findall (pattern, s)
