#Слова у нас могут состоять из букв или букв, стоящих вокруг дефиса (во-первых, чуть-чуть, давай-ка). Попробуем это описать регулярным выражением
import re
text = '''
                    - Дельный, что и говорить,
                      Был старик тот самый,
                      Что придумал суп варить
                      На колесах прямо.
                      Суп - во-первых. Во-вторых,
                      Кашу в норме прочной.
                      Нет, старик он был старик
                      Чуткий - это точно.
re.findall('\w+[а-яА-Я], text)
