#Дана строка.
#Сначала выведите третий символ этой строки (считая, что нумерация символов начинается с 1).
#Во второй строке выведите предпоследний символ этой строки.
#В третьей строке выведите первые пять символов этой строки.
#В четвертой строке выведите всю строку, кроме последних двух символов.
#В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0).
#В шестой строке выведите все символы с нечетными индексами (считая, что индексация начинается с 0).
#В седьмой строке выведите все символы в обратном порядке.
#В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
#В девятой строке выведите длину данной строки.


x = str(input())
print ('1.',x[2])
print ('2.', x[-2])
print ('3.', x[:5])
print ('4.', x[0:-2])
print ('5.', x[::2])
print ('6.', x[1::2])
print ('7.', x[::-1])
print ('8.', x [-1::-2])
print ('9.', len(x))
