#Группа из 3 студентов пишет заявки на желаемые факультативы из списка: английский, немецкий, право, математика, сольфеджио.
#Факультатив откроют, если на него запишутся все студенты.
#Каждый студент может выбрать минимум один и максимум три факультатива.
#Нужно посчитать количество факультативов, которые откроются.

students = {1, 2, 3}
subjects = ['английский', 'немецкий', 'право', 'математика', 'сольфеджио']
student1 = set(input())
student2 = set(input())
student3 = set(input())
print (student1 & student2 & student3)


