#Даны три целых числа. Определите, сколько среди них совпадающих.
#Программа должна вывести одно из чисел: 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа различны).

x1 = int(input())
x2 = int(input())
x3 = int(input())
if x1 == x2 == x3:
    print (3)
elif x1 == x2 or x2 == x3 or x1 ==x3:
    print (2)
else:
    print (0)
    
